/*
Да се напише програма, която чете от стандартния вход произволен брой
положителни числа и извежда на стандартния изход квадратните им корени, но
в обратен ред на срещането.
Вход
N положителни числа.
Забележка: Числата се четат до края на файла.
Изход
За всяко въведено число да се изведе корен квадратен от него с 6 цифри
след десетичната точка (поведение по подразбиране при употреба на printf с
низ “%lf”) и след него да се изведе нов ред. То трябва да бъде изведено след
като са изведени корените на числата след него. (Т.е. извеждането е в обратен
ред).
Ограничения
TL: 0.1 s
ML: 16 MB
0 <= N <= 2^16
*/
#include <iostream>
#include <stdio.h>
#include <math.h>

int main() {
	float n;
	float input[1 << 16];
	int k = 0;
	while (scanf("%f", &n) != EOF) {
		input[k] = n;
		k++;
	}
	while (k - 1 >= 0) {
		printf("%lf\n", sqrt(input[k - 1]));
		k--;
	}
}
