/*
За нуждите на ЦЕРН даден масив от данни, които те обработват, трябва да бъде сортиран. За
съжаление в ЦЕРН всички са твърде заети, за да напишат алгоритъм за сортиране, защото
последният им опит е излязал извън контрол и ако не бъдат взети спешни мерки, Земята ще бъде
погълната от черна дупка. Можете ли да помогнете на ЦЕРН?
За да може ЦЕРН да се възползва от алгоритъма ви, те ще ви зададат цяло число N < 10000, брой
на числа, които трябва да се сортират, последвано от редица от цели числа всяко от които е по-
малко от 10000000. Вие трябва за техните нужди да сортирате масива лексикогравски. Това става
като сравняваме първите цифри и ако при едното цифрата е по-малка, то е по-малко. Ако са
равни продължаваме със следващите цифри. Ако на някое от числата цифрите му се изчерпат
преди тези на другото по описания алгоритъм, тогава то е по-малкото (например 190 е по-голямо
от 1000).
Изхода от програмата ви трябва да е сортираните числа като всяко се принтира на отделен ред.
*/
#include <iostream>
#include <stdio.h>
#include <string.h>

using namespace std;

int N;
char M[10000][8];
char temp[8];
void sort() {
    for(int j=0; j< N; j++){
        for (int i = 0; i < N - 1; i++) {
            if (strcmp(M[i],M[i+1]) > 0) {
                strcpy(temp, M[i]);
                strcpy(M[i], M[i + 1]);
                strcpy(M[i + 1], temp);
            }
        }
    }
}

int main()
{
        scanf("%d", &N);

        for (int i = 0; i < N; i++) {
            scanf("%s", M[i]);
        }
        sort();
        for (int j = 0; j <N; j++) {
            printf("%s \n", M[j]);
        }
    return 0;
}
